In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_csv('ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv('ex2.csv',names=['a','b','c','d','e'])

   a   b   c   d      e
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [8]:
parsed = pd.read_csv('csv_mindex.csv',index_col=['key1', 'key2'])

In [9]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [18]:
result = pd.read_table('ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [17]:
list(open('ex3.txt'))

['A B C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb 0.927272 0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382 1.100491']

In [21]:
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
result=pd.read_csv('ex5.csv')

In [23]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [26]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [27]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## 逐块读取文本文件

In [31]:
pd.options.display.max_rows = 10
result=pd.read_csv('dem.csv')

In [32]:
result

              ID  GRIDCODE         lon        lat
0              1      1304  119.081651  54.003922
1              2      1311  119.097776  54.003922
2              3       996  119.186458  54.003922
3              4      1002  119.198551  54.003922
4              5       937  119.287233  54.003922
...          ...       ...         ...        ...
1048570  1048571       460  129.594532  45.885463
1048571  1048572       389  129.614687  45.889494
1048572  1048573       364  129.622749  45.885463
1048573  1048574       458  129.634842  45.885463
1048574  1048575       440  129.650966  45.885463

[1048575 rows x 4 columns]

In [33]:
pd.read_csv('dem.csv', nrows=5)

   ID  GRIDCODE         lon        lat
0   1      1304  119.081651  54.003922
1   2      1311  119.097776  54.003922
2   3       996  119.186458  54.003922
3   4      1002  119.198551  54.003922
4   5       937  119.287233  54.003922

In [34]:
chunker = pd.read_csv('dem.csv', chunksize=1000)
chunker

In [35]:
chunker = pd.read_csv('dem.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['ID'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

In [36]:
tot[:10]

1048575    1.0
349520     1.0
349533     1.0
349532     1.0
349531     1.0
349530     1.0
349529     1.0
349528     1.0
349527     1.0
349526     1.0
dtype: float64

## 将数据写到文本格式

In [37]:
data=pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
data.to_csv('out.csv')

In [39]:
import sys
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [40]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [42]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('tseries.csv')

## 处理分隔符格式

In [43]:
import csv
f=open('ex7.csv')
reader=csv.reader(f)

In [44]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [46]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))
header, values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

## JSON数据

In [47]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [48]:
import json

In [49]:
result=json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [50]:
asjson=json.dumps(result)

In [51]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [52]:
data = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [58]:
import lxml

# 二进制数据格式

In [56]:
frame=pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [63]:
frame.to_pickle('frame_pickle')

In [64]:
pd.read_pickle('frame_pickle')

           a
0  -0.142162
1  -1.734594
2   0.103425
3   1.149859
4   3.212787
..       ...
95 -1.759239
96 -0.415979
97  0.536090
98 -0.804086
99  0.247264

[100 rows x 1 columns]

# Web APls交互

In [67]:
import requests

In [68]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [69]:
data = resp.json()
data[0]['title']

'BUG: MultiIndex not dropping nan level and invalid code value'

In [70]:
issues = pd.DataFrame(data, columns=['number', 'title',
 'labels', 'state'])
issues

,number,title,labels,state
0,26408,BUG: MultiIndex not dropping nan level and inv...,[],open
1,26407,SparseArrays backed by other Extension array/d...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
2,26406,BUG: to_numpy on categorical data with tz awar...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,26405,DEPR: deprecate Series/DataFrame.compound,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
4,26404,Fix type annotations in pandas.core.indexes.da...,[],open
...,...,...,...,...
25,26380,ENH: Implementing NEP 18's __array_function__,[],open
26,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
28,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open

# 数据库交互

In [72]:
import sqlite3

In [73]:
query = """
.....: CREATE TABLE test
 (a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
 );"""

In [74]:
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [75]:
con.commit()

In [76]:
data = [('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)

In [77]:
 con.commit()

In [78]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [79]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [80]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [82]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5